@extends('layout.app')

@section('title', 'Про проект')

@section('content')
    <div class="cols-block">
        <div class="cols-block-header">
            <div class="block-title">ПРО ПРОЕКТ</div>
            <div class="block-sub-title"></div>
        </div>
        <div class="cols-block-content">
            <img src="{{ asset('img/cat.jpg') }}" alt="Cat">
            <p>
                Інформаційна система <b>Реєстр домашніх тварин</b> - це платформа із <br>
                прозорою технічною та технологічною можливістю її подальшого <br>
                розвитку та забезпечення централізованого керованого сховища <br>
                даних усіх зареєстрованих тварин у місті Києві та надання <br>
                громадянам можливості зручної реєстрації власних тварин,<br>
                супроводу таких даних, а також цільового використання<br>
                інформації про тварину.<br><br>
                Створена в рамках Комплексної міської цільової програми<br>
                «Електронна столиця».
            </p>
        </div>
    </div>
@endsection