<?php

use Illuminate\Database\Seeder;

class BlocksSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $this->addBlock([
            'title' => 'about-page',
            'subject' => null,
            'body' => 'Текст сторінки \'Про проект\''
        ]);

        $this->addBlock([
            'title' => 'email.new-animal',
            'subject' => 'Верифікуйте вашого улюбленця',
            'body' => 'Текст повідомлення'
        ]);

        $this->addBlock([
            'title' => 'animal-verify',
            'subject' => null,
            'body' => '<p>
                                Для закінчення реєстрації тварини Вам необхідно звернутися до Служби обліку та реєстрації тварин, за адресою:
                       </p>
                       <p>
                           <b>м. Київ</b><br>
                           <b>проспект Відрадний, 61</b><br>
                           <b>т. 044-497-65-23.</b>
                       </p>
                       <p>
                           <b>При собі мати:</b><br>
                           - документ, що посвідчує особу<br>
                           - ветеринарний паспорт<br>
                           - тварину.
                       </p>
                       <p>
                           <b>Часи роботи:</b><br>
                           Пн-Чт 9:00-18:00 год.<br>
                           Пт 9:00-16:45 год.<br>
                           Обід 13:00-14:00 год.
                       </p>'
        ]);

        $this->addBlock([
            'title' => 'email.request-accepted',
            'subject' => 'Ваш запит на тваринку було схвалено!',
            'body' => 'Ваш запит на тваринку було схвалено!'
        ]);

        $this->addBlock([
            'title' => 'email.request-cancelled',
            'subject' => 'Ваш запит на тваринку було відхилено!',
            'body' => 'Ваш запит на тваринку було відхилено!'
        ]);

        $this->addBlock([
            'title' => 'agreement-page',
            'subject' => null,
            'body' => '<p>ЗГОДА</p>
                        <p>на обробку персональних даних</p>
                        <p>Відповідно до Закону України "Про захист персональних даних" (далі - Закон) користувач цього сайту дає згоду на:</p>
                        <p>- обробку його персональних даних з первинних джерел у такому обсязі: паспортні дані, дані про зареєстроване або фактичне місце проживання, номери телефонів;</p>
                        <p>- використання персональних даних, що передбачає дії володільця персональних даних щодо їх обробки, в тому числі використання персональних даних відповідно до їх професійних чи службових або трудових обов\'язків, 
                        дії щодо їх захисту, а також дії щодо надання часткового або повного права на обробку персональних даних іншим суб\'єктам відносин, пов\'язаних із персональними даними (стаття 10 Закону);</p>
                        <p>- поширення персональних даних, що передбачає дії володільця персональних даних щодо передачі відомостей про фізичну особу (стаття 14 Закону);</p>
                        <p>- доступ до персональних даних третіх осіб, що визначає дії володільця персональних даних у разі отримання запиту від третьої особи щодо доступу до персональних даних, 
                        доступ суб\'єкта персональних даних до відомостей про себе (стаття 16 Закону).</p>
                        <p>Зобов\'язуюся в разі зміни моїх персональних даних подати у найкоротший строк уточнену достовірну інформацію та оригінали відповідних документів для оновлення моїх персональних даних.
                        </p>'
        ]);
    }

    private function addBlock($block)
    {
        if (!\App\Models\Block::where('title', '=', $block['title'])->first()) {
            \App\Models\Block::create($block);
        }
    }
}
