<?php

use Illuminate\Database\Seeder;

class BlocksSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $this->addBlock([
            'title' => 'about-page',
            'subject' => null,
            'body' => 'Текст сторінки \'Про проект\''
        ]);

        $this->addBlock([
            'title' => 'email.new-animal',
            'subject' => 'Верифікуйте вашого улюбленця',
            'body' => 'Текст повідомлення'
        ]);

        $this->addBlock([
            'title' => 'animal-verify',
            'subject' => null,
            'body' => '<p>
                                Для закінчення реєстрації тварини Вам необхідно звернутися до Служби обліку та реєстрації тварин, за адресою:
                       </p>
                       <p>
                           <b>м. Київ</b><br>
                           <b>проспект Відрадний, 61</b><br>
                           <b>т. 044-497-65-23.</b>
                       </p>
                       <p>
                           <b>При собі мати:</b><br>
                           - документ, що посвідчує особу<br>
                           - ветеринарний паспорт<br>
                           - тварину.
                       </p>
                       <p>
                           <b>Часи роботи:</b><br>
                           Пн-Чт 9:00-18:00 год.<br>
                           Пт 9:00-16:45 год.<br>
                           Обід 13:00-14:00 год.
                       </p>'
        ]);

        $this->addBlock([
            'title' => 'email.request-accepted',
            'subject' => 'Ваш запит на тваринку було схвалено!',
            'body' => 'Ваш запит на тваринку було схвалено!'
        ]);

        $this->addBlock([
            'title' => 'email.request-cancelled',
            'subject' => 'Ваш запит на тваринку було відхилено!',
            'body' => 'Ваш запит на тваринку було відхилено!'
        ]);

        $this->addBlock([
            'title' => 'agreement-page',
            'subject' => null,
            'body' => '<p>ЗГОДА</p>
                        <p>на обробку персональних даних</p>
                        <p>Відповідно до Закону України "Про захист персональних даних" (далі - Закон) користувач цього сайту дає згоду на:</p>
                        <p>- обробку його персональних даних з первинних джерел у такому обсязі: паспортні дані, дані про зареєстроване або фактичне місце проживання, номери телефонів;</p>
                        <p>- використання персональних даних, що передбачає дії володільця персональних даних щодо їх обробки, в тому числі використання персональних даних відповідно до їх професійних чи службових або трудових обов\'язків, 
                        дії щодо їх захисту, а також дії щодо надання часткового або повного права на обробку персональних даних іншим суб\'єктам відносин, пов\'язаних із персональними даними (стаття 10 Закону);</p>
                        <p>- поширення персональних даних, що передбачає дії володільця персональних даних щодо передачі відомостей про фізичну особу (стаття 14 Закону);</p>
                        <p>- доступ до персональних даних третіх осіб, що визначає дії володільця персональних даних у разі отримання запиту від третьої особи щодо доступу до персональних даних, 
                        доступ суб\'єкта персональних даних до відомостей про себе (стаття 16 Закону).</p>
                        <p>Зобов\'язуюся в разі зміни моїх персональних даних подати у найкоротший строк уточнену достовірну інформацію та оригінали відповідних документів для оновлення моїх персональних даних.
                        </p>'
        ]);

        $this->addBlock([
            'title' => 'rules-page',
            'subject' => null,
            'body' => '<p>Правила утримання і догляду за домашніми тваринами</p>
                    <p><br></p>
                    <p>Правила утримання домашніх тварин визначені Законом «Про захист тварин від жорстокого поводження» та Рішенням КМР 
                    «Про врегулювання питань утримання та поводження з собаками і котами в м. Києві», які встановлюють порядок утримання, використання, 
                    визначення ступеня небезпечності в умовах міста, визначають права та обов\'язки власників собак і котів.</p>
                    <p><br></p>
                    <p>Власники тварин повинні:</p>
                    <p>- дбати про домашню тварину, забезпечити їй достатню кількість їжі та постійний доступ до води;</p>
                    <p>- дотримуватись санітарно-гігієнічних норм утримання тварин, зокрема, прибирати екскременти в місцях загального користування;</p>
                    <p>- забезпечувати тишу з 22.00 до 08.00 та не порушувати громадський порядок;</p>
                    <p>- слідкувати, щоб тварина не втекла з місця її утримання;</p>
                    <p>- запобігати прояву агресії з боку тварин по відношенню до людей, інших тварин або майна;</p>
                    <p>- вигулювати тварину в в рамках правил вигулу, не обмежувати в рухах та можливості контактувати з собі подібними;</p>
                    <p>- забезпечити за потреби намордником, поводком, нашийником з ідентифікуючими позначками;</p>
                    <p>- забезпечувати потрібну ветеринарну допомогу (обстеження, лікування, щеплення тощо);</p>
                    <p>- негайно повідомляти медичну або ветеринарну установу про випадки нанесення ушкоджень здоров\'ю людині або іншим тваринам;</p>
                    <p>- запобігати неконтрольованому розмноженню домашніх тварин.</p>
                    <p><br></p>
                    <p>Власникам тварин заборонено:</p>
                    <p>- жорстоко поводитись з тваринами або знущатися, знищувати їх;</p>
                    <p>- проводити собачі бої, а також селекціонувати, навчати та використовувати собак для боїв;</p>
                    <p>- використовувати собак та котів для отримання з них м\'яса і шкурок;</p>
                    <p>- купати тварин на території міських пляжів та у фонтанах; - навчати собак атакувати людину в життєво важливі органи – навчання повинно проводитись 
                    за спеціальними програмами особами з відповідною професійною підготовкою та реєстраційним свідоцтвом;</p>
                    <p>- вигулювати без повідка тварин та проводити навчання за межами спеціальних місць;</p>
                    <p>- залишати тварин бездоглядними, залишених тварин виловлюють та утримують в притулках; пошуком бездоглядних тварин в Києві займається «Центр ідентифікації тварин».</p>
                    <p><br></p>
                    <p>Де та за яких умов можна утримувати собак та котів:</p>
                    <p>- у квартирах, де проживає одна сім\'я;</p>
                    <p>- у квартирах, де проживає кілька сімей, лише за письмовою згодою всіх повнолітніх мешканців квартири;</p>
                    <p>- біля дому, якщо огорожа забезпечує ізоляцію тварини на внутрішній території та є попереджувальна табличка про існування тварини;</p>
                    <p>- на території і/або приміщенні, що не належить власнику тварини на правах власності за умови письмової згоди власника території і/або приміщення;</p>
                    <p>- у куточках живої природи (дитячих, освітніх, наукових, санаторно-курортних і оздоровчих закладів) за погодженням з державними органами санітарно-епідеміологічної служби та ветеринарної медицини;</p>
                    <p>- на територіях об\'єктів будівництва, підприємств, установ, організацій за умов наявності обладнаних приміщень та попереджувальної таблички про існування тварин;</p>
                    <p>- забороняється утримувати тварин у місцях загального користування (коридорах, приміщеннях підвального типу, на сходах, горищах тощо);</p>
                    <p>- забороняється утримувати незареєстрованих собак.
                    </p>'
        ]);
    }

    private function addBlock($block)
    {
        if (!\App\Models\Block::where('title', '=', $block['title'])->first()) {
            \App\Models\Block::create($block);
        }
    }
}
